{"id":"Objektdiagrammer.txt#content","checksum":"01960784dba0e59cd25ead0141a32c26","text":"Object diagrams show the state of the object structures, with values ​​of attributes and references linking objects together. Often, the types of the objects represented in a separate Class Diagrams Class Diagram and must be understood in the context of it. The figure above shows three objects, an instance of Playlist-class and two of the Song class. Playlist object has a name attribute with a value of &quot;Beatles ballades,&quot; and the two Song objects have both name and playLength attributes with specific values. Playlist object also has two songs-links (eng: link), one for each of the two Song objects. Objects / instances targets appear as boxes, with a identifikasjonsdel and a contents. Identification section shows the identity and type of the form # identity: type. The identity is not required, but is useful to refer to the object without using arrows and possibly from text. The identity is usually a number with no other meaning than that it is unique to the chart, but may well be a combination of letters and numbers, for example. playlist1, if it makes the graph easier to read. Attributes The attributes and associated values ​​are displayed in the content section below the identity area, with one attribute / value pairs pr. line. This can be used for simple values ​​and object references (links), while the values ​​/ objects can be represented with an appropriate text. Eg. can specify a reference to a date as a text, even if the date is actually a separate object with its own attribute / value pairs. Note that such a textual notation for object-references makes it impossible to show that the same object has several references to it, so it should only be used for functional objects objects that behave as single values. If the object does not have a suitable textual representation, so one can use the identity. If the attribute has multiple values ​​(many multiplicity) then prints the values ​​consecutively in curly braces. References A reference (eng: link) is shown as an arrow (line with arrowhead) from (the edge of) the box that owns references to the edge of the object referenced. The name of the reference appears at or top of the line, so that one knows what the underlying attribute that has reference (s) value. A more compact notation is to use attribute notation with the name and identity (s) as attribute / value pairs."}