{"id":"Koding.txt#content","checksum":"3cb98a1c22d9fb50cd4fe5e2a36f3c2c","text":"There are many things one can do in Eclipse, and this sums up just what I was on when I wrote since the first time. Extended by subsequent revisions, and often with contributions from others! Eclipse is primarily a tool for writing code easy. The program helps you to complete the code, cleaning up the code, and generate code automatically. When working in Eclipse will appear red or yellow streaks below the text you type. You can hover over the code to see what Eclipse react. A red bar means that something is wrong - you forgot a semicolon, made a method call that is not allowed, or other defects that allow the compiler will not be able to handle the code you have written. The yellow lines show up where unnecessary code, such as variables or import of code that is not used. Complete code shortcut to complete the code in Eclipse (Ctrl + Space) on PC, and??? Mac. You can always press this shortcut and get suggestions for what to write. If you have long variable, field or method name, you can type the beginning of the name, press Ctrl + Space, select the appropriate option from the list that appears and press enter. If you have an object (ie a list) and you&#39;re wondering what methods you can perform on that object, type &quot;variable name.&quot; and press Ctrl + Space. You will get an overview of the different methods. Clean up your code Eclipse lets you rename a variable or method in a place so that the change is copied to all other references. Right-click on a name, select &quot;Refactor&quot; and &quot;Rename&quot;. In java is there a requirement that a code block has the correct indentation relative to the surrounding code blocks. There are still many who think code is more straightforward with the &quot;correct&quot; indentation. Eclipse automatically cleans up the code - note the whole file (Ctrl + A) and press (Ctrl + I). Automatic code generation If you create a class that inherits from an abstract superclass or implements an interface Eclipse will generate the methods herein. It is also possible to generate &quot;getter&quot; and &quot;sets&quot; of data fields in the class. (Getter and sets used by individual data fields - see Housing.)"}