<p>Objekter og klasser er de sentrale begrepene i <ac:link><ri:page ri:content-title="Objektorientert programmering" /></ac:link>, og kan oppfattes som to sider av samme sak. Objekter eksisterer ved kj&oslash;ring av programmer, mens klasser er koden som styrer hvordan objektene oppf&oslash;rer seg. Objekter kan ses p&aring; som en m&aring;te &aring; dele opp tilstanden til et kj&oslash;rende program i logiske enheter, mens klasser kan ses p&aring; som en m&aring;te &aring; dele opp koden i (tilsvarende) logiske enheter. Koden i hver klasse bestemmer hvordan tilstanden til en bestemt type objekt eller datakapsel oppf&oslash;rer seg, dvs. utvikler seg over tid.</p><table><tbody><tr><th>Objekt</th><th>Klasse</th></tr><tr><td><p>Del av et kj&oslash;rende program som</p><ul style="list-style-type: square;"><li>inneholder data (tilstand)</li><li>kan utf&oslash;re beregninger og operasjoner p&aring; dataene</li></ul></td><td><p>Koden som bestemmer</p><ul style="list-style-type: square;"><li>hva slags data som et objekt av en bestemt type kan inneholde</li><li>hva en kan be objektet gj&oslash;re av beregninger og operasjoner</li></ul></td></tr></tbody></table><p>Forestill deg en app for h&aring;ndtering og avspilling av musikk. N&aring;r du bruker app'en vil den vite om alle sangene (eller l&aring;tene/stykkene/sporene...), albumene (eller cd'ene/lp'ene...), artistene (eller gruppene/orkestrene...) og spillelistene. Hver av disse kan representeres som objekter, alts&aring; sang-<em>objekter</em>, album-<em>objekter</em> og spilleliste-<em>objekter</em>. Hvert sang-<em>objekt</em> vil vite navnet p&aring; sangen, lengden, lyddataene som m&aring; spilles av og hvilket album det tilh&oslash;rer. Hvert album-<em>objekt</em> vil vite hvilke sanger det inneholder, hvem som har skrevet (komponist) og hvem som fremf&oslash;rer (artist) sangene (kanskje vil ogs&aring; sang-objektene inneholde informasjon om komponist og artist, siden de jo kan varierer p&aring; samme album). Sang- og album-<em>klassene</em>, p&aring; den annen side, kan ses p&aring; som (koden som bestemmer) reglene for hva slags type data hvert sang- og album-<em>objekt</em> kan inneholde og hvordan disse h&aring;ndteres, f.eks. at ett og samme sang-<em>objekt</em> ikke kan tilh&oslash;re mer enn ett album-<em>objekt</em>. Klassen m&aring; ogs&aring; s&oslash;rge for at koblingen mellom sang-<em>objekter</em> og album-<em>objekter</em> er <em>konsistent</em>, slik at det altid er slik at et sang-objekt ligger i sang-lista til albumet det tilh&oslash;rer.</p><table><tbody><tr><th>Sang-objekt</th><th>Sang-klasse</th></tr><tr><td><p>Konkrete data om bestemt sang:</p><ul style="list-style-type: square;"><li>Tittel: Imagine</li><li>Artist: John Lennon</li><li>Lyddata: 011011...</li></ul><p>Kan gj&oslash;re f&oslash;lgende beregninger/operasjoner p&aring; sine data</p><ul style="list-style-type: square;"><li>setTitle</li><li>play</li></ul></td><td><p>Beskriver strukturen til alle Sang-objekter:</p><ul style="list-style-type: square;"><li>Tittel: tekst</li><li>Artist: referanse til Person-objekt</li><li>Lyddata: bin&aelig;re tall</li></ul><p>Kode for beregninger/operasjoner</p><ul style="list-style-type: square;"><li>setTitle - endrer tittel</li><li>play - spiller av lyd-dataene</li></ul></td></tr></tbody></table><p>Oppdelingen av tilstanden til det kj&oslash;rende programmet i objekter og av programkoden i klasser bestemmes av programmereren. Det er ofte &oslash;nskelig at strukturen av objekter tilsvarer/speiler v&aring;r oppfatning av virkeligheten, slik at strukturen av objekter/kode blir lettere &aring; tenke ut/skrive og forst&aring;/lese. Derfor er det viktig &aring; v&aelig;re godt kjent med problemomr&aring;det f&oslash;r en setter seg ned og programmerer, i tillegg til at en kan generelle kodingsteknikker (se fotnote 1).</p><h3>Sider om objekter og klasser</h3><p><ac:macro ac:name="pagetree"><ac:parameter ac:name="root">@self</ac:parameter><ac:parameter ac:name="excerpt">true</ac:parameter></ac:macro></p><h3>Oppgaver om objekter og klasser</h3><p><ac:macro ac:name="metadata-report"><ac:parameter ac:name="pages">@descendants</ac:parameter><ac:parameter ac:name="link">Page</ac:parameter><ac:parameter ac:name="label">sidetype-oppgave</ac:parameter><ac:default-parameter>Page,Dekningsgrad,Omfang</ac:default-parameter></ac:macro></p><hr /><p>1) Det fremheves ofte som en fordel med objektorientert programmering at koden tilsvarer (er en modell av) virkeligheten og derfor faller naturlig &aring; skrive. Dette er i beste fall en grov forenkling av problemetstillingen, f.eks. oppfatter ikke alle virkeligheten likt og et program vil dessuten ofte kreve objekter/kode som ikke svarer til virkeligheten. Vi skal ikke ta denne debatten her, og oppfordrer istedet programmerere til bevissthet og edruelighet omkring fordeler og ulemper ved OOP i forhold til andre paradigmer.</p><ac:macro ac:name="metadata-list"><ac:parameter ac:name="orientation">horizontal</ac:parameter><ac:plain-text-body><![CDATA[|| Sidetype | oversikt |
|| Ferdig | 95 |
|| Dekningsgrad | 25 |
|| Omfang | 25 |]]></ac:plain-text-body></ac:macro>